{
    "news.google.co.in": "Comprehensive, up-to-date news coverage, aggregated from sources all over ... Coronavirus update: Covid-19 cases in India surge to 21,700, death toll at 686.",
    "indiatoday.in ": "India News: Get latest news & live updates from India, live India news headlines, breaking news India. Read all latest India news & top news on India Today.\nNews · India News, Latest News India ... · Coronavirus India · Let India Breathe",
    "news.abplive.com ": "15 minutes ago · Check latest & LIVE Updates of Coronavirus outbreak in India and across the globe: 9:19 PM IST | 23 Apr 2020. 54 Test Positive In Tamil Nadu, ...",
    "thehindu.com ": "Read the Latest News On Business, Politics, Sports, Entertainment & Much More From India And Around The World At The Hindu.",
    "aajtak.intoday.in": "AajTak: Hindi news (हिंदी समाचार) website, watch live tv coverages, Latest Khabar, Breaking news in Hindi of India, World, Sports, business, film and ...",
    "ndtv.com": "NDTV.com provides latest news from India and the world. Get today's news headlines from Business, Technology, Bollywood, Cricket, videos, photos, live news ...",
    "rediff.com ": "4 hours ago · Rediff.com: India's leading website for Indian news, news columns, interviews, news specials, hot news topics & more.",
    "business-standard.com ": "7 hours ago · Several major economies have extended lockdowns of eight-nine weeks. This contrasts to the previous assumption of around five weeks. An ...",
    "youtube.com ": "India Today TV is India's leading English News Channel. India Today YouTube channel offers latest news videos on Politics, Business, Cricket, Bollywood, Life...",
    "economictimes.indiatimes.com ": "5 hours ago · View: India can show the way to be smart, not coy, on rolling back decades of inflation-era dogma. It's time to establish credibility with action, and ...",
    "news.google.com": "Comprehensive up-to-date news coverage, aggregated from sources all over the world by Google News.",
    "edition.cnn.com": "Find the latest breaking news and information on the top stories, weather, business, entertainment, politics, and more. For in-depth coverage, CNN provides ...",
    "bloombergquint.com ": "3 hours ago · Bloomberg | Quint is a multiplatform, Indian business and financial news company. We combine Bloomberg's global leadership in business and ...",
    "moneycontrol.com ": "20 minutes ago · Today is the thirtieth day of India's nationwide lockdown, which has been extended till May 3. Confirmed COVID-19 cases in India stand at ...",
    "news.un.org ": "UN News produces daily news content in Arabic, Chinese, English, French, Kiswahili, Portuguese, Russian and Spanish, and weekly programmes in Hindi, ...",
    "who.int ": "Countries in the WHO South-East Asia Region: Bangladesh · Bhutan · Democratic People's Republic of Korea · India · Indonesia · Maldives · Myanmar · Nepal ...",
    "aljazeera.com ": "Stay on top of India's biggest stories by Al Jazeera.",
    "bbc.com ": "Get the latest Asian news from BBC News in Asia: breaking news, features, analysis and special reports plus audio and video from across the Asian continent.",
    "firstpost.com": "Latest News Headlines: Firstpost covers Latest India News, Top Todays Breaking News on Business, India, World, Politics, Entertainment and Sports ...",
    "hindustantimes.com": "News Headlines: Hindustan Times provides exclusive top stories of the day, today headlines from politics, business, technology, photos, videos, latest English  ...",
    "jagran.com ": "Indian Railways: लॉकडाउन के बाद ट्रेनों के संचालन पर मंथन, शताब्दी जैसी ट्रेनों में मिलेगा सिर्फ पानी. uttar-pradesh1 hour ago ...",
    "livemint.com ": "... Top News Headlines, Breaking News for Business, Money, Science and Technology and more. Browse Livemint for Politics, India, World, Current affairs news ...",
    "abcnews.go.com": "Your trusted source for breaking news, analysis, exclusive interviews, headlines, and videos at ABCNews.com.",
    "news18.com": "Read CNN-News18 breaking news, latest news from India and World including live news updates, current news headlines on politics, cricket, business, ...",
    "www.nature.com ": "Latest science news and analysis from the world's leading research journal.",
    "dharitriepaper.in ": "2 days ago · Odia ePaper - Read today Odia ePaper news online with one of most popular online Odia News Paper and get all latest and breaking news in ...",
    "theguardian.com ": "Support The Guardian. Available for everyone, funded by readers. Contribute Subscribe. Back to top. © 2020 Guardian News & Media Limited or its affiliated ...",
    "telegraph.co.uk ": "Latest breaking news, including politics, crime and celebrity. Find stories, updates and expert opinion.",
    "play.google.com ": "Rating  4.4  (12,70,587)   · Free  · AndroidGoogle News is a smart news app that organizes what's happening in the world to help you learn more about the stories that matter to you. Stay up to date • The ...",
    "amarujala.com ": "Today Latest India News in Hindi (आज की ताजा खबर Khabar) पढने के लिए log on करें अमर उजाला (AmarUjala.com) #1 hindinews website. Get आज तक ...",
    "financialexpress.com ": "1 hour ago · Coronavirus India LIVE State Wise Latest News Updates: The total number of Coronavirus positive cases presently stands at 21700. There are ...",
    "sciencemag.org ": "Support nonprofit science journalism. Science's extensive COVID-19 coverage is free to all readers. To support our nonprofit science journalism, please make a ...",
    "zeenews.india.com": "Zee News brings latest news from India and World on breaking news, today news headlines, politics, business, technology, bollywood, entertainment, sports and ...",
    "cnet.com ": "CNET news editors and reporters provide top technology news, with investigative reporting and in-depth coverage of tech issues and events.",
    "laravel-news.com": "Laravel News is the official blog of Laravel. Every day bringing you the latest news, tutorials, and packages for the framework.",
    "timesnownews.com": "India News: Catch all the latest news from India, news from Politics, Elections, Business, Tech, Cricket, Health, Astrology on Times Now.",
    "bhaskar.com ": "27 minutes ago · ... रिकवरी रेट 20% | Coronavirus | Mumbai Delhi Coronavirus News | Coronavirus Outbreak India Cases LIVE Updates; Maharashtra Pune ...",
    "businesstoday.in ": "Business Today offering the latest news from the world of business and Indian Economy News, business news analysis, editorials, opinion, industry analysis, ...",
    "manoramaonline.com ": "Malayala Manorama Online News: Kerala's leading Malayalam news portal. Watch live news coverages from Kerala, Gulf region, UK, US & around the world.",
    "oneindia.com ": "Read all latest India news and get today's breaking news updates on Indian politics, elections, sports, business, economy, cricket, current affairs, education, ...",
    "medicalnewstoday.com": "Medical news and health news headlines posted throughout the day, every day.",
    "space.com ": "Space.com is your source for the latest astronomy news and space discoveries, live coverage of space flights and the science of space travel.",
    "express.co.uk ": "Latest UK news, breaking news and current news, plus political news from Express.co.uk, all the latest breaking stories.",
    "mirror.co.uk ": "The latest UK and World news, from Mirror Online. Find the best stories, opinion, pictures and video on the day's events.",
    "newsinlevels.com": "We write news in three different levels of English. We want to help you understand English more. Now all students can enjoy reading and listening to news.",
    "www3.nhk.or.jp ": "NHK WORLD provides the latest news from Japan, Asia and around the world.",
    "breakingnewsenglish.com": "Breaking News English Lessons - 2885 FREE Easy News English lesson plans. EFL/ESL graded news lessons, news in 7 levels, current events.",
    "cricbuzz.com ": "NewsTopics. Latest News. April 23 2020. Smith took the 'sandpaper gate' blame to save his team: Flintoff. April 22 2020. The Cheatsheet. Spells from Hell: ...",
    "nytimes.com ": "11-Apr-2020 · Follow the latest news about the United States here. As coronavirus cases rise in Latin America, murder rates fall.",
    "republicworld.com ": "India News: Get the latest breaking news from India & today's news headlines. Keep yourself informed with all the current India news and live news updates only ...",
    "livescience.com ": "Get the latest science news and learn about scientific breakthroughs and discoveries from around the world. See how science is making today's news.",
    "carwale.com ": "Check out Latest Car News, Auto Launch Updates and Expert Views on Indian Car Industry at CarWale.",
    "sundayguardianlive.com ": "Read the latest News news, comment and analysis articles on India and world News from the SundayGuardianLive's columnists.",
    "usnews.com ": "Get breaking news from the US and the world. Read about politics, the economy, health care, the environment, education, the Trump administration, Congress ...",
    "thenewsminute.com ": "The two attackers, who Arnab has alleged are members of the Youth Congress, have been arrested by the Mumbai police. Immigration Apr 23, 2020 - 10:31 ...",
    "flightglobal.com ": "Aviation news covering airlines, aerospace, air transport, defence, safety and business aviation by global regions.",
    "news.sky.com ": "The latest international news from Sky, featuring top stories from around the world and breaking news, as it happens.",
    "metro.co.uk ": "News. Last Updated: 2:35 GMT, 23 April 2020 ...",
    "newsonair.com": "Prez gives assent to Ordinance making acts of violence against healthcare workers cognizable, non-bailable offence More than 33 cr poor given financial ...",
    "fox8.com ": "Do you want to know what is going on in Northeast Ohio and around the country? FOX 8 Cleveland has you covered.",
    "clickondetroit.com ": "Detroit news, Michigan news and national news headlines all are offered on ClickOnDetroit's news page. Find all coverage of breaking news from WDIV Detroit.",
    "siasat.com ": "... Crime · Sports · Photos · Videos. 23 Apr 2020, Thu. The Siasat Daily. Home / News. News. Unemployment staring the faces of men who work in haleem joints.",
    "dawn.com ": "Checkout for the Latest and Top News from Pakistan and around the world.",
    "manoramanews.com": "MMTV Kerala's No 1 News and Infotainment Channel delivers Breaking News from Kerala Districts India and World. News Sports News Cricket News Updates.",
    "globalnews.ca ": "Global News World - breaking international news & current world news headlines ; international money news and business news on GlobalNews.ca.",
    "thenews.com.pk": "The News International - latest news and breaking news about Pakistan, world, sports, cricket, business, entertainment, weather, education, lifestyle; opinion ...",
    "jsonline.com ": "Milwaukee and Wisconsin news, photos, video and investigative reporting from the Journal Sentinel and JSOnline.com.",
    "msn.com ": "Get latest news from India, breaking news on Indian politcs & elections, live coverage on MSN India. News from NDTV, Indian Express, Hindustan Times & more.",
    "oilprice.com ": "1 hour ago · The U.S. became the seventh biggest oil supplier to India in the year through March 2020, climbing up from the 9th place in the top suppliers' list ...",
    "euronews.com": "Latest breaking news available as free video on demand. Stay informed on European and world news about economy, politics, diplomacy… with Euronews.",
    "in.yahoo.com": "Get latest news, email, live cricket scores and fresh finance, lifestyle, entertainment content daily.",
    "newyorker.com ": "In-depth reporting, commentary on breaking news, political analysis, and opinion from The New Yorker.",
    "altnews.in ": "02-Jan-2018 · The news on Republic TV about Jama Masjid being in dark due to non-payment of electricity bills will make it to any top ten list of fake news. This ...",
    "aninews.in": "ANI brings the latest news on Politics and Current Affairs in India & around the World, Sports, Health & Fitness, Entertainment, News.",
    "buzzfeednews.com": "BuzzFeed News has breaking stories and original reporting on politics, world news, social media, viral trends, health, science, technology, entertainment, and  ...",
    "thehindubusinessline.com ": "Get live updates of national news, political news, latest news on sports and economy, live news updates, national events, special reports, and international news ...",
    "wsj.com ": "Discover The Wall Street Journal's breaking news and analysis on national news coverage including politics, government, economy, health care, education, ...",
    "rnz.co.nz ": "The latest NZ News and audio interviews from RNZ - New Zealand's leading news team.",
    "sciencedaily.com": "Breaking science news and articles on global warming, extrasolar planets, stem cells, bird flu, autism, nanotechnology, dinosaurs, evolution -- the latest ...",
    "cbsnews.com ": "The page is not available. The page may have been removed, had its name changed, or is just temporarily unavailable. LIVE; More. Latest · Video · Photos ...",
    "thetelegraphandargus.co.uk ": "Get the latest news from in and around Bradford, continually updated, from the Bradford Telegraph and Argus.",
    "gadgetsnow.com ": "Today Latest News - Find Latest Technology News for the latest Gadgets i.e. ... in India in the state-run BSNL's tender for the deployment of fourth-generation or ...",
    "time.com": "Breaking news and analysis from TIME.com. Politics, world news, photos, video, tech reviews, health, science and entertainment news.",
    "ksat.com ": "News headlines and videos from KSAT 12, the San Antonio, Texas leader in breaking news, weather and sports.",
    "cbc.ca ": "Get the latest news, tips on prevention and your coronavirus questions answered every evening. Email address:.",
    "espncricinfo.com": "Find Live Cricket Scores, Match updates, Fixtures, Results, News, Articles, Video highlights only at ESPNcricinfo. Read Ball by Ball Commentary, Series ...",
    "azfamily.com ": "The latest Arizona headlines, including breaking news, in-depth investigations and hyper-local stories that matter to the people of Arizona.",
    "bloomberg.com": "Bloomberg delivers business and markets news, data, analysis, and video to the world, featuring stories from Businessweek and Bloomberg News.",
    "facebook.com ": "BBC News India. 3363829 likes · 42750 talking about this. This is the official Facebook page for the BBC in India where you can find the best content...",
    "reddit.com ": "r/news: /r/news is: real news articles, primarily but not exclusively, news relating to the United States and the rest of the World. /r/news isn't …",
    "africanews.com": "Find out all about latest breaking news, daily news and hot news in Africa. African politics, African business, African sports, health and technology on, also ...",
    "www.xinhuanet.com ": "Home · Latest News · China · World · Business · Photos · Video · Culture & Edu · Sports · Sci & Tech · Health · Special Reports · Entertainment · Xinhua New ...",
    "theweek.in ": "Pollutions levels in north India at 20-year low: NASA. Average particulate matter decreased by 22 per cent. Web Desk April 23, 2020 ...",
    "news.com.au": "We say what people are thinking and cover the issues that get people talking balancing Australian and global moments — from politics to pop culture.",
    "nationalpost.com ": "Read latest breaking news, updates, and headlines. Get information on latest national and international events & more.",
    "nydailynews.com": "Find breaking US news, local New York news coverage, sports, entertainment news, celebrity gossip, autos, videos and photos at nydailynews.com.",
    "instagram.com ": "12.4m Followers, 65 Following, 9769 Posts - See Instagram photos and videos from BBC News (@bbcnews)",
    "abplive.com ": "India News in Hindi: पढ़ें देश की हर छोटी-बड़ी खबर, देश के सबसे विश्वसनीय न्यूज़ चैनल ABP न्यूज़ पर.",
    "usatoday.com ": "Get the latest national, international, and political news at USATODAY.com.",
    "nasa.gov ": "NASA.gov brings you the latest images, videos and news from America's space agency. Get the latest updates on NASA missions, watch NASA TV live, and ...",
    "in.reuters.com ": "Reuters India provides the top Indian News headlines. Read breaking news for today, latest news headlines from India in business, markets, sports, politics, ...",
    "timeslive.co.za ": "Latest news from South Africa, World, Politics, Entertainment and Lifestyle. The home of The Times and Sunday Times newspaper.",
    "gulfnews.com": "Get the latest update on UAE, business, life style, UAE jobs, gold rate, Exchange rate, UAE holidays, Dubai police, RTA and prayer times from UAE's largest ...",
    "techradar.com ": "Rating  4.5     · Review by Gareth BeavisTECH DEALS, PRIZES AND LATEST NEWS. Get the best TechRadar India deals , reviews, product advice, competitions, unmissable tech news and more!",
    "arynews.tv ": "Pakistan Latest & Breaking News updates on Politics, Current Affairs, Sports, Technology, Entertainment & Business all at one place..",
    "google.com ": "Monitor the web for interesting new content. How often. As-it-happens. At most once a day. At most once a week. Sources. Automatic. News. Blogs. Web. Video.",
    "ajc.com ": "Atlanta Georgia News main page: Breaking News, Atlanta Weather Forecast, Crime, Politics, GA Schools, Local Articles - Atlanta Journal-Constitution.",
    "huffpost.com ": "Catch up on the latest U.S. news, stories, photos, and videos. Including local news, political coverage, and more.",
    "ibo.org ": "3 days ago · ... the Novel Coronavirus, we will update this page with developing news and actions that are being taken to support and protect our community.",
    "indianexpress.com ": "India News: Get Latest India News, Coronavirus News in India, live India news headlines, breaking news India. Read all the latest India news & today's top news  ...",
    "katu.com": "KATU ABC 2 offers coverage of news, weather, sports and community events for Portland, Oregon and surrounding towns, including Beaverton, Lake Oswego, ...",
    "techcrunch.com": "TechCrunch - Reporting on the business of technology, startups, venture capital funding, and Silicon Valley.",
    "sciencenews.org": "Science News features daily news articles, feature stories, reviews and more in all disciplines of science, as well as Science News magazine archives back to ...",
    "gamespot.com ": "Read the most authoritative, up-to-date news and headlines from the video games and entertainment industry at GameSpot.",
    "mid-day.com ": "... and breaking news in India with in-depth news articles, photos and videos. Stay updated with top headlines on India news and Indian national news at Mid- day.",
    "www.ptinews.com": "Instead of tackling COVID-19, BJP spreading virus of communal prejudice, hatred : Sonia Gandhi; 13:45 HRS IST; New Delhi: Congress president Sonia Gandhi ...",
    "thesun.ie ": "Today's News Videos. 00:54. LOCKDOWN LOUT. Sick moment woman, 39, coughs at ... Latest in News. VIRUS CRISIS. Coronavirus LIVE: Lockdown could last ...",
    "ddnews.gov.in": "DDNews, News, National News, Indian News, Sports News.",
    "apple.com ": "Apple News provides the best coverage of current events, curated by expert editors. And enjoy hundreds of popular publications with Apple News+.",
    "manchestereveningnews.co.uk ": "Manchester news updates from the Manchester Evening News team. Covering central and Greater Manchester, including news from Oldham, Rochdale and ...",
    "slashdot.org": "5 hours ago · Slashdot: News for nerds, stuff that matters. Timely news source for technology related news with a heavy slant towards Linux and Open Source ...",
    "abc.net.au ": "The latest World News headlines, photos, video and audio content from the ABC's trusted network of overseas-based journalists.",
    "portsmouth.co.uk ": "news, sport, business, lifestyle and more, from Portsmouth's newspaper, The News.",
    "newstodaynet.com": "Home · CHENNAI · BY ELECTIONS 2019 · TN Bypoll Results 2019 · Music Season 2018 · TAMILNADU · ENTERTAINMENT · Bollywood · Hollywood · NATION.",
    "people.com ": "Get the latest news from PEOPLE.com, from the best in celebrity, entertainment and the royals to breaking crime and human interest developments.",
    "lokmat.com ": "6 hours ago · Latest Marathi News (मराठी बातम्या). Find Breaking Headlines, Current and Latest solapur news in Marathi at Lokmat.com.",
    "dnaindia.com": "Latest News Headlines and Live Updates - DNA India Covers all latest and breaking news on Politics, Business, Sports, Bollywood, technology & health from  ...",
    "newscientist.com": "Science news and science articles from New Scientist.",
    "apnews.com ": "News from The Associated Press, the definitive source for independent journalism from every corner of the globe.",
    "uscis.gov ": "Here we have the latest news within the immigration benefit world, handled by U.S. Citizenship and Immigration Services (USCIS). Both news media and ...",
    "forbes.com ": "The latest breaking news stories from Forbes.com.",
    "dailymail.co.uk ": "Discover the latest global news from the Daily Mail and Mail on Sunday. Sign up for newsletters to stay informed on breaking world news and global headlines.",
    "france24.com ": "Breaking news and world news from France 24 on Business, Sports, Culture. Video news. News from the US, Europe, Asia Pacific, Africa, Middle East, America.",
    "nypost.com ": "Read the latest news and breaking news for local, U.S. and world events on the New York Post.",
    "standard.co.uk ": "All the latest news in London, around the UK and the world from the London Evening Standard.",
    "homebanao.com ": "Mattress? Online? Yeah, you heard that right. Many buyers are usually skeptical of purchasing home décor and furniture online. They are unsure about the ...",
    "channelnewsasia.com": "Breaking news and latest stories from Singapore, Asia and around the world; commentary, business, sports, technology, health and more. Watch CNA live.",
    "news.google.ca": "Comprehensive, up-to-date news coverage, aggregated from sources all over the world by Google News.",
    "protocol.com ": "2 days ago · As Mark Zuckerberg, Campbell Brown, and the Facebook News team rushed to get reliable coronavirus news to billions of Facebook users, ...",
    "dailypost.ng ": "News6 mins ago. Aisha Buhari sends message to Patience Jonathan over COVID-19. The wife of President Muhammadu Buhari, Aisha, on Thursday, ...",
    "9news.com.au": "Latest news and headlines from Australia and the world.",
    "news.in": "News of India with latest updated News from parts of INDIA.",
    "inshorts.com ": "Bookmark. Categories and Topics. CATEGORIES. Top Stories. All News. Trending. Bookmarks. SUGGESTED TOPICS. Citizenship Amendment Act.",
    "cnbc.com ": "Get complete CNBC business news coverage online. Find the latest regional business news pertaining to the United States of America including headlines & top ...",
    "nriol.com ": "Latest News Online - Get latest Indian news update online. Read latest breaking news headlines online in India about business, sports, market and politics etc.",
    "books.google.co.in ": "Belvedere House is now home to the National Library of India. ... I was reading about the French Revolution as breaking news, before it was even called the ...",
    "ctvnews.ca": "Canadian news and headlines from around the world. Live breaking news, national news, sports, business, entertainment, health, politics and more from ...",
    "rte.ie ": "... all of the latest breaking local and international news stories as they happen, with up to the minute updates and analysis, from Ireland's National Broadcaster.",
    "breakingnews.ie": "Ireland's premier breaking news website providing up to the minute news and sports reports. With e-mail news releases following breaking stories throughout ...",
    "m.news24.com": "News24, South Africa's premier news source, provides breaking news on national, world, Africa, sport, entertainment, technology & more.",
    "iol.co.za ": "Top stories and news highlights from around South Africa, Africa and across the globe as they happen. Read the latest local and International news on IOL ...",
    "vaticannews.va ": "3 days ago · By Vatican News. The Vatican has announced that two major international ecclesial events will be postponed. In a statement released Monday ...",
    "independent.com ": "15 hours ago · The Independent's news team is writing more about the coronavirus than could ever hope to be contained in these pages. That's why you ...",
    "naidunia.com ": "Latest News in Hindi (लेटेस्ट हिंदी न्यूज़) - naidunia brings (ताजा समाचार) latest news in Hindi From India and World. Find latest news from ...",
    "rainews.it": "Rai News: il primo canale all news italiano. Scopri le ultime notizie in tempo reale . News e aggiornamenti su politica, cronaca, esteri, economia, sport e attualità.",
    "edition.cnn.com ": "View the latest India news, videos, headlines and opinion on CNN.com.",
    "hindustantimes.com ": "India News - Find Latest India News and Breaking News today from India on Politics, Business, Entertainment, Technology, Sports, Lifestyle and more at ...",
    "firstpost.com ": "Firstpost provides Latest News in India, Live News India, India Breaking News, today's India news, Top headlines of India.",
    "ndtv.com ": "Get Latest and breaking news from India. Today's Top India News Headlines, news on Indian politics and government, Business News, Bollywood News and ...",
    "news18.com ": "News18.com brings all the latest India news and top breaking news live only on News18.com. Read latest India news, current affairs and news headlines online ...",
    "thehindu.com": "Today's News Headlines, Breaking News & Latest News from India and World, News from Politics, Sports, Business, Arts and Entertainment.",
    "newsindiatimes.com": "The group publishes five periodicals – “News India Times,” a national weekly newspaper; “Desi Talk in New York,” a weekly newspaper serving the New ...",
    "news.google.com ": "COVID-19 news:See the latest coverage of the coronavirus (COVID-19). keyboard_arrow_right. Livemint. Coronavirus recovery rate in India improves, 1,334 ...",
    "independent.co.uk ": "All the latest breaking news on India. Browse The Independent's complete collection of articles and commentary on India.",
    "scroll.in": "Scroll.in is an independent website covering news, politics, sports, culture and everything in between. Get the latest news, reportage, analysis and commentary  ...",
    "dnaindia.com ": "DNA India brings latest India news and top breaking news live from all the states and cities of India that are happening on DNAIndia.com. Read all updated India ...",
    "indiatvnews.com": "News in English: Get all Breaking News Headlines from India and World. Photos, Live news coverage and Latest News from Politics, Bollywood, Bihar Election ...",
    "zeenews.india.com ": "India News, National News: Zee News brings latest news from India including breaking news, current India news live, political news, Indian sports news, and ...",
    "theprint.in": "India's digital platform for latest news and reports, insightful analyses, opinion on politics, policy, governance, economy, education, defence and culture.",
    "thewire.in": "Get the latest news, top headlines, opinions, analysis and much more from India and World including current news headlines on elections, politics, economy, ...",
    "deccanherald.com": "Latest News: Find the Latest News Headlines from India & around the World. Deccan Herald brings breaking news, today's Live News on Sports, Business, ...",
    "tribuneindia.com": "Tribune brings you all the top latest breaking news andLive Updates. Get India news, current affairs and news headlines online today.",
    "outlookindia.com": "Outlook India, more than just a news magazine, offers today's news, top headlines, videos, photos and blogs on India, politics, world, business, cricket and ...",
    "newindianexpress.com": "Latest India updates online, breaking news, and news from southern states of Tamil Nadu, Karnataka, Kerala, Andhra Pradesh, Telangana and Odisha. Get all  ...",
    "aajtak.intoday.in ": "04:28 PM. कोरोना के खिलाफ बाकी देशों की तुलना में आज हम बेहतर स्थिति में: पर्यावरण मंत्रालय. 0 0. 04:20 PM. कोरोना का ...",
    "siasat.com": "Latest news Hyderabad, Telangana, India, Islamic and around the World on Political, Current Affairs, Sports, Culture, Bollywood, Health, Technology News.",
    "scoopwhoop.com ": "Get the Latest News from India & World, Breaking News From India, Current Affairs, Viral News, Top Trending Stories and Latest News from Politics, Sports, ...",
    "samachar.com": "Get India news from Indian publications on Samachar.com. News from NDTV, Times of India, India Today, The Hindu, sify.com. Get news in Hindi, Bengali, Tamil ...",
    "worldometers.info ": "India Coronavirus update with statistics and graphs: total and new cases, deaths per day, ... Total Coronavirus Cases in India ... View More News view more ...",
    "news.microsoft.com ": "Responding to COVID-19 in India together. Technology, solutions, tips, and resources are helping us work and learn remotely while staying safe and connected.",
    "marathi.abplive.com ": "India Marathi News (भारत ताज्या बातम्या): वाचा भारत आजचे ताज्या बातम्या ABP माझावर. Read India Latest News and Updates on ABP ...",
    "espncricinfo.com ": "Read about India Cricket Team latest Scores, News, Articles only on ESPNcricinfo.com. Find Team live Scores, Photos, Roster, Match updates Today.",
    "in.news.yahoo.com": "Top news stories from Bengaluru. Babita Phogat, Don't Create the Divide You Worked Hard to Erase. Celebrity.",
    "patrika.com ": "India Hindi News (हिंदी न्यूज़): देश के सबसे विश्वसनीय Hindi News Website Patrika पर पढ़ें और पाएं इंडिया, देश, विदेश, बाजार, ...",
    "w3newspapers.com ": "List of Indian newspapers and news agencies in English and links to the pages of non-English language news media in India.",
    "india.gov.in": "News Highlights. News · Additions to the Portal · Govt allows ...",
    "en.wikipedia.org ": "Network18 Media & Investments Limited, informally referred to as the BnD Network18 Group, is an Indian media and entertainment group. ... TV18 operates India's largest selection of News channels across 15 language and 26 states; with ...",
    "pmindia.gov.in ": "The Union Cabinet chaired by the PM has approved significant investments to the tune of Rs. 15,000 crore for 'India COVID-19 Emergency Response and ...",
    "www.uniindia.com": "By Pallab Bhattacharya New Delhi, Apr 23(UNI) The Online gaming industry in India is witness to an unprecedented rise in traffic in the past one month crossing  ...",
    "maharashtratimes.com ": "Web Title : India News in Marathi (Marathi News from Maharashtra Times , TIL Network). Marathi News; india news. Explore Maharashtra Times. एक नजर ...",
    "ibef.org ": "Our collection of news showcases India's achievements in technology, trade, economic cooperation, IT and more. This gives you insights into the growing sectors ...",
    "thestatesman.com": "The Statesman is an Indian English-language broadsheet daily newspaper founded in 1875 and published simultaneously in Kolkata, New Delhi, Siliguri and ...",
    "crn.in": "Get latest Information Technology (IT) Channel News & Updates, latest technology / tech news, updates & partner resources for IT Channel, IT Reseller & IT ...",
    "team-bhp.com ": "Trusted reporting on the latest happenings in the Indian Car industry. View ✓ Spy shots ✓ Launch dates ✓ Prices ✓ Pictures ✓ Sales figures ✓ Recalls of recently ...",
    "livehindustan.com ": "10 hours ago · कोरोना संकट और लॉकडाउन की वजह coronavirus india latest news covid-19 -death-toll 23 april 2020 Corona Lockdown coronavirus World ...",
    "bengali.abplive.com ": "India News in Bengali: Read India Latest News in Bengali. বাংলায় দেশের খবর পড়ুন, বাংলায় দেশের খবর পড়ুন এবিপি আনন্দে.",
    "sony.co.in": "Discover a wide range of high quality products from Sony and the technology behind them, get instant access to our store and Entertainment Network.",
    "grainmart.in ": "India's labour indicator worsens as job crisis looms through the economy. CMIE confirms that unemployment increased… News · Supply Chain Most Important ...",
    "khaleejtimes.com ": "Khaleej Times World News- India news, Pakistan news, U.S. news, Afghanistan news, Bangladesh news, Iran news, Iraq and other world news.",
    "en.as.com ": "18 hours ago · Coronavirus live India: latest Covid-19 news - Wednesday 22 April. India coronavirus update at 00:00 CEST (03:30 IST) on Thursday 23 April.",
    "zeebiz.com ": "India Business News: Zee Business provides the latest business headlines, business news India, Indian economy News & Indian market news. Stay updated  ...",
    "nationalheraldindia.com ": "National Herald brings to you latest news, political analyses, breaking news and opinions from India. Follow National Herald on Twitter and Facebook to stay ...",
    "defencenews.in": "Welcome to Defence News. India's first & foremost dedicated Defence News Website. We throughly cover all three services of the Indian Armed Forces and bring ...",
    "bbc.co.uk ": "18 hours ago · Coronavirus: The controversy over 'India's first virus fatality' ... Siddiqui has just returned to India after a month-long stay with his younger son, who works as a dentist in Jeddah, Saudi Arabia. ... Why you can trust BBC News ...",
    "wired.com ": "12-Dec-2018 · The messaging app owned by Facebook has become a major channel for hate speech and false stories in India. The government is ...",
    "channelnewsasia.com ": "12 hours ago · By clicking subscribe, I agree to receive news updates and promotional material from Mediacorp and Mediacorp's partners. Subscribe ...",
    "hotstar.com ": "Watch the latest Hindi news Live on the World's Most Subscribed News Channel. Aaj Tak is India's best Hindi News more. Watchlist. Share ...",
    "indialegallive.com ": "Court Orders - Read the latest High Court Judgement Order here. Get all the Latest Court News and Special Report about High Court by India Legal.",
    "about.fb.com ": "2 days ago · We look forward to working with Jio, and to future collaborations in India to advance this vision. Categories. : Company News Economic ...",
    "news.fresherslive.com ": "Grab all the latest and new India News breaking celebrity India News news articles are updated instantly. Find the latest India News and Celebrity news instantly ...",
    "bloomberg.com ": "29-Mar-2020 · It's the phone calls at all hours of the night he remembers. As swine flu ravaged northern India in 2015, a radiologist working at a hospital in a ...",
    "gulfnews.com ": "12 hours ago · Labor shortages in India due to the virus-led lockdown may push farmers in the nation's second-biggest rice growing state to switch to cotton, ...",
    "npr.org ": "5 hours ago · In India, Muslims have been accused of deliberately spreading the virus. ... Arnab Goswami, a news anchor on India's popular Republic TV, ...",
    "nbcnews.com ": "1 day ago · Six tourists, including one American, were rescued from a cave in India where they retreated amid the coronavirus pandemic lockdown, officials ...",
    "timesofindia.indiatimes.com ": "India News: Times of India brings the top news headlines from India on Politics, Current Affairs, Sports, Entertainment, Technology and Indian Business News.",
    "m.economictimes.com ": "Latest news today - Read all the Latest Business News today on The Economic Times. ... Locked-down Indian economy in its worst quarter since mid-1990s.",
    "republicworld.com": "Stay informed with today's latest news from India & around the world. Get all the breaking news & current Indian news on politics, sports and entertainment only ...",
    "outlookindia.com ": "Outlook brings to you today news from India along with top headlines, current news and live updates on politics, national issues and news from states.",
    "bloombergquint.com": "Follow the latest & live news in India on BloombergQuint. Stay updated on business, markets, economy, politics & the world with latest & breaking news on a  ...",
    "telegraphindia.com": "Read Latest News on Politics, Business, Sports, Bollywood, Technology, and Science on The Telegraph India. Stay with us!",
    "english.jagran.com": "Top English News Headline - Find latest breaking news from India and world about politics, entertainment, movie review, Sports, business and more at Jagran  ...",
    "english.jagran.com ": "Find the latest and breaking news from India. Get the top news headlines on sports, entertainment, politics, economy, current affairs only at english.jagran.com .",
    "indiatv.in": "इंडिया टीवी Brings Latest Hindi News (हिन्दी न्यूज़) on Politics, Business, Bollywood, Cricket, Education, Sports and more from India and around the ...",
    "blog.feedspot.com ": "Indian news Website Best List. Get latest news from Indian newspapers, India latest news, India news live, online Indian news by following top Indian news sites.",
    "dailypioneer.com ": "India News in english, breaking news India - The Pioneer brings the breaking news, top news headlines from India on Politics, Current Affairs, Sports, ...",
    "thequint.com": "Latest & Breaking News Headlines on Coronavirus LIVE: Latest political news, cricket updates and business news at The Quint. Read latest movie ... Live tracker of the number of coronavirus cases reported and recovered in India. 15.5k  ...",
    "businesstoday.in": "Latest Business News - Business Today is one of the best business magazine in India which offers you latest updates about stocks, NSE, BSE, Top Companies, ...",
    "asianage.com ": "Get the latest and breaking news from all parts of the nation.",
    "english.lokmat.com": "Get Today's Top Headlines, Breaking news alert, Trending news and Latest India News at Lokmat. Also Read Latest News from politics, Bollywood, ...",
    "telanganatoday.com": "Telangana Today brings the latest telangana news headlines, Telugu news ... Rotary club. Round Table India, Rotary Club donate 1.5 lakh meals in Hyderabad .",
    "printweek.in ": "Get up-to-the-minute news, in-depth analysis. PrintWeek India is an indispensable hub for anyone working in or connected with print.",
    "sangbadpratidin.in ": "মাত্র ১৫ টাকায় ভরপেট খাবার! দুস্থদের সাহায্যে ফের এগিয়ে এল রেল. Posted: April 23, 2020 2:50 pm| Updated: April 23, 2020 2:50 pm. স্টেশন ও আশপাশের অঞ্চলে কুড়ি ...",
    "thequint.com ": "Breaking news India, Latest news India, Hot news in India. Get all the Latest news and India news. Read all the News headlines from India and the World on The ...",
    "dtnext.in ": "11 hours ago · Number of people who recovered in Maharashtra stands at 789. In the national capital, it is 724 and in Gujarat 179 people have recovered so ...",
    "sumanasa.com ": "Zee News हिंदी से और… ... सामने · Positive India: लॉकडाउन में जरूरतमंदों की मदद करेगा 'Free Ration App', नहीं होगी खाने की दिक्कत.",
    "sbs.com.au ": "10 hours ago · Dharvi, India's biggest slum, is home to an estimated one million people. ... News and information is available in 63 languages at ...",
    "maharashtratimes.com": "Get latest Marathi news from Maharashtra, India and World. Maharashtra Times, a Marathi news paper provides news in Marathi, Marathi batmya, today's news ...",
    "makemytrip.com ": "Find breaking news & updates on Air India, get latest stories, full news coverage & articles on Air India only at Makemytrip.com.",
    "tellychakkar.com": "Online publication exclusively covering television news, OTT News, VOD, digital ecosystem, content creators, producers, Stars, Celebrity News and shows.",
    "punjabi.abplive.com": "Punjabi News - ABP Punjabi provides latest news, videos, photos from Punjab and the world. Get today's news ... Coronavirus in INDIA. 29Day of Lockdown.",
    "www.10tv.in": "Indian Girl's Batting Skills Wows Shai Hope, Michael Vaughan. మరో 4 పులులు, 3 సింహాలకు కరోనా వైరస్. Coronavirus News: 4 more tigers, 3 lions ...",
    "fxstreet.com ": "1 day ago · USD/INR steps back from the record top to 76.75. BSE SENSEX rises 1.75% as Facebook buys a 9.99% stake in India's Reliance Jio for $5.7 ...",
    "thebetterindia.com ": "Current News related positive news from India."
}